Examinator/src/Catalogs/РазделыФорумаСУО/РазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыФорумаСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Модератор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РазделыФорумаСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДляВсехПриИзменении(Элемент)
	
	Если Объект.ДляВсех Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДляВсехУстановка", ЭтотОбъект);			
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Раздел форума будет доступен всем пользователям.
		|Список пользователей, которым в настоящее время доступен раздел будет очищен. 
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
		
	Иначе
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВсехУстановка(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ДляВсех = Ложь;
	    Возврат;
	КонецЕсли; 
	
	Сч = Объект.Видимость.Количество();

	Пока Сч > 0 Цикл
		
		Строка = Объект.Видимость.Получить(Сч - 1);

		Если НЕ Строка.Модератор Тогда
			Объект.Видимость.Удалить(Сч - 1);
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыВидимость

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Видимость

&НаКлиенте
Процедура ВидимостьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.Модератор = Объект.ДляВсех;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	ВсеМодераторы = Новый Массив;
	Для каждого Строка Из Объект.Видимость Цикл
		Если Строка.Модератор Тогда
			ВсеМодераторы.Добавить(Строка.Пользователь);
		КонецЕсли;
	КонецЦикла;	
	
	Объект.Видимость.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
			
		НоваяСтрока = Объект.Видимость.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь; 
		
		Если Объект.ДляВсех Тогда
			НоваяСтрока.Модератор = Истина;
		Иначе
			НоваяСтрока.Модератор = ?(ВсеМодераторы.Найти(ВыбранныйПользователь) = Неопределено, Ложь, Истина);
		КонецЕсли;		
		
	КонецЦикла;
	
	Объект.Видимость.Сортировать("Пользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	НачатьПодбор();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Подбор(Команда)
	
	НачатьПодбор();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НачатьПодбор()
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Видимость);

КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Объект.ДляВсех Тогда
		Элементы.СтраницаВидимость.Заголовок = НСтр("ru = 'Модераторы'");
	Иначе
		Элементы.СтраницаВидимость.Заголовок = НСтр("ru = 'Доступность'");
	КонецЕсли;
	
	Элементы.ВидимостьМодератор.Доступность = НЕ Объект.ДляВсех;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Видимость Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = Строка.Пользователь.Наименование;
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции


#КонецОбласти
